nxp-mcuxpresso/mcux-sdk-examples/lpcxpresso802/demo_apps/led_blinky/pin_mux.h
/*
 * Copyright 2019 ,2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PIO0_7 (number 17), CN5[4]/CN3[27]/CN6[2]/LD17/LD18/PIO0_7_GPIO3-LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_USER_LED_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_USER_LED_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_USER_LED_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_USER_LED_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_USER_LED_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M0P */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
